#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.bucket_suffix: Refreshing state... [id=nqESug]
google_compute_network.vpc: Refreshing state... [id=projects/mike-personal-portfolio/global/networks/flash-crash-vpc]
google_service_account.dataflow_sa: Refreshing state... [id=projects/mike-personal-portfolio/serviceAccounts/flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/mike-personal-portfolio/locations/us-central1/repositories/flash-crash-repo]
google_pubsub_topic.stock_ticks: Refreshing state... [id=projects/mike-personal-portfolio/topics/stock-ticks-topic]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/mike-personal-portfolio/datasets/flash_crash_data]
google_storage_bucket.dataflow_templates: Refreshing state... [id=flash-crash-templates-9ea112ba]
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/mike-personal-portfolio/locations/global/workloadIdentityPools/github-actions-pool-v3]
google_storage_bucket.temp_bucket: Refreshing state... [id=flash-crash-staging-9ea112ba]
google_pubsub_subscription.stock_ticks_sub: Refreshing state... [id=projects/mike-personal-portfolio/subscriptions/stock-ticks-sub]
google_bigquery_table.table: Refreshing state... [id=projects/mike-personal-portfolio/datasets/flash_crash_data/tables/aggregated_stats]
google_project_iam_member.dataflow_worker["roles/bigquery.dataEditor"]: Refreshing state... [id=mike-personal-portfolio/roles/bigquery.dataEditor/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/artifactregistry.writer"]: Refreshing state... [id=mike-personal-portfolio/roles/artifactregistry.writer/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/dataflow.admin"]: Refreshing state... [id=mike-personal-portfolio/roles/dataflow.admin/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/pubsub.editor"]: Refreshing state... [id=mike-personal-portfolio/roles/pubsub.editor/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/storage.objectAdmin"]: Refreshing state... [id=mike-personal-portfolio/roles/storage.objectAdmin/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_project_iam_member.dataflow_worker["roles/dataflow.worker"]: Refreshing state... [id=mike-personal-portfolio/roles/dataflow.worker/serviceAccount:flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com]
google_compute_router.router: Refreshing state... [id=projects/mike-personal-portfolio/regions/us-central1/routers/dataflow-router]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/mike-personal-portfolio/regions/us-central1/subnetworks/dataflow-subnet]
google_compute_firewall.dataflow_internal: Refreshing state... [id=projects/mike-personal-portfolio/global/firewalls/allow-dataflow-internal]
google_service_account_iam_member.wif_binding: Refreshing state... [id=projects/mike-personal-portfolio/serviceAccounts/flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/166016129616/locations/global/workloadIdentityPools/github-actions-pool-v3/attribute.repository//flash_crash_detector]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/mike-personal-portfolio/locations/global/workloadIdentityPools/github-actions-pool-v3/providers/github-provider-v3]
google_compute_router_nat.nat: Refreshing state... [id=mike-personal-portfolio/us-central1/dataflow-router/dataflow-nat]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.ingestion_service will be created
  + resource "google_cloud_run_v2_service" "ingestion_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "stock-ingestion-service"
      + observed_generation     = (known after apply)
      + project                 = "mike-personal-portfolio"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev//flash-crash-repo/ingestion-service:latest"

              + env {
                  + name  = "mike-personal-portfolio"
                    # (1 unchanged attribute hidden)
                }

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # google_cloud_scheduler_job.poller_trigger will be created
  + resource "google_cloud_scheduler_job" "poller_trigger" {
      + attempt_deadline = "30s"
      + id               = (known after apply)
      + name             = "every-minute-trigger"
      + paused           = (known after apply)
      + project          = "mike-personal-portfolio"
      + region           = "us-central1"
      + schedule         = "* * * * *"
      + state            = (known after apply)
      + time_zone        = "Etc/UTC"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)

          + oidc_token {
              + service_account_email = "flash-crash-runner@mike-personal-portfolio.iam.gserviceaccount.com"
            }
        }
    }

  # google_dataflow_flex_template_job.flash_crash_job will be created
  + resource "google_dataflow_flex_template_job" "flash_crash_job" {
      + additional_experiments       = (known after apply)
      + autoscaling_algorithm        = (known after apply)
      + container_spec_gcs_path      = "gs://flash-crash-templates-9ea112ba/templates/flash_crash_spec.json"
      + effective_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                           = (known after apply)
      + job_id                       = (known after apply)
      + kms_key_name                 = (known after apply)
      + launcher_machine_type        = (known after apply)
      + machine_type                 = (known after apply)
      + max_workers                  = (known after apply)
      + name                         = "flash-crash-detector-live"
      + network                      = (known after apply)
      + num_workers                  = (known after apply)
      + on_delete                    = "cancel"
      + parameters                   = {
          + "input_subscription" = "projects/mike-personal-portfolio/subscriptions/stock-ticks-sub"
          + "output_table"       = ":flash_crash_data.crashes"
          + "workerRegion"       = "us-central1"
        }
      + project                      = (known after apply)
      + region                       = "us-central1"
      + sdk_container_image          = (known after apply)
      + service_account_email        = (known after apply)
      + skip_wait_on_job_termination = false
      + staging_location             = (known after apply)
      + state                        = (known after apply)
      + subnetwork                   = (known after apply)
      + temp_location                = (known after apply)
      + terraform_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>